### Terraform Prod Config
#### 🖌 Format and Style: `success`
false

#### 🛠 Initialization: `success`

#### 🔎 Validation: `success`
#### 📖 Plan: `success`

<details><summary>Show Plan</summary>

```terraform


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # google_compute_firewall.ssh-server[0m will be created
[0m  [32m+[0m[0m resource "google_compute_firewall" "ssh-server" {
      [32m+[0m[0m creation_timestamp = (known after apply)
      [32m+[0m[0m destination_ranges = (known after apply)
      [32m+[0m[0m direction          = (known after apply)
      [32m+[0m[0m enable_logging     = (known after apply)
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m name               = "default-allow-ssh-prod"
      [32m+[0m[0m network            = "vpc-network-prod"
      [32m+[0m[0m priority           = 1000
      [32m+[0m[0m project            = (known after apply)
      [32m+[0m[0m self_link          = (known after apply)
      [32m+[0m[0m source_ranges      = [
          [32m+[0m[0m "0.0.0.0/0",
        ]
      [32m+[0m[0m target_tags        = [
          [32m+[0m[0m "ssh-server",
        ]

      [32m+[0m[0m allow {
          [32m+[0m[0m ports    = [
              [32m+[0m[0m "22",
            ]
          [32m+[0m[0m protocol = "tcp"
        }
    }

[1m  # google_compute_instance.etl-host[0m will be created
[0m  [32m+[0m[0m resource "google_compute_instance" "etl-host" {
      [32m+[0m[0m allow_stopping_for_update = true
      [32m+[0m[0m can_ip_forward            = false
      [32m+[0m[0m cpu_platform              = (known after apply)
      [32m+[0m[0m current_status            = (known after apply)
      [32m+[0m[0m deletion_protection       = false
      [32m+[0m[0m guest_accelerator         = (known after apply)
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m instance_id               = (known after apply)
      [32m+[0m[0m label_fingerprint         = (known after apply)
      [32m+[0m[0m machine_type              = "e2-micro"
      [32m+[0m[0m metadata                  = {
          [32m+[0m[0m "enable-oslogin" = "true"
        }
      [32m+[0m[0m metadata_fingerprint      = (known after apply)
      [32m+[0m[0m min_cpu_platform          = (known after apply)
      [32m+[0m[0m name                      = "etl-host-prod"
      [32m+[0m[0m project                   = (known after apply)
      [32m+[0m[0m self_link                 = (known after apply)
      [32m+[0m[0m tags                      = [
          [32m+[0m[0m "ssh-server",
        ]
      [32m+[0m[0m tags_fingerprint          = (known after apply)
      [32m+[0m[0m zone                      = "us-east1-d"

      [32m+[0m[0m boot_disk {
          [32m+[0m[0m auto_delete                = true
          [32m+[0m[0m device_name                = (known after apply)
          [32m+[0m[0m disk_encryption_key_sha256 = (known after apply)
          [32m+[0m[0m kms_key_self_link          = (known after apply)
          [32m+[0m[0m mode                       = "READ_WRITE"
          [32m+[0m[0m source                     = (known after apply)

          [32m+[0m[0m initialize_params {
              [32m+[0m[0m image  = "ubuntu-os-cloud/ubuntu-2204-jammy-v20220420"
              [32m+[0m[0m labels = (known after apply)
              [32m+[0m[0m size   = (known after apply)
              [32m+[0m[0m type   = (known after apply)
            }
        }

      [32m+[0m[0m network_interface {
          [32m+[0m[0m ipv6_access_type   = (known after apply)
          [32m+[0m[0m name               = (known after apply)
          [32m+[0m[0m network            = (known after apply)
          [32m+[0m[0m network_ip         = (known after apply)
          [32m+[0m[0m stack_type         = (known after apply)
          [32m+[0m[0m subnetwork         = (known after apply)
          [32m+[0m[0m subnetwork_project = (known after apply)

          [32m+[0m[0m access_config {
              [32m+[0m[0m nat_ip       = (known after apply)
              [32m+[0m[0m network_tier = "STANDARD"
            }
        }
    }

[1m  # google_compute_network.vpc_network[0m will be created
[0m  [32m+[0m[0m resource "google_compute_network" "vpc_network" {
      [32m+[0m[0m auto_create_subnetworks                   = true
      [32m+[0m[0m delete_default_routes_on_create           = false
      [32m+[0m[0m gateway_ipv4                              = (known after apply)
      [32m+[0m[0m id                                        = (known after apply)
      [32m+[0m[0m internal_ipv6_range                       = (known after apply)
      [32m+[0m[0m mtu                                       = (known after apply)
      [32m+[0m[0m name                                      = "vpc-network-prod"
      [32m+[0m[0m network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      [32m+[0m[0m project                                   = (known after apply)
      [32m+[0m[0m routing_mode                              = (known after apply)
      [32m+[0m[0m self_link                                 = (known after apply)
    }

[1m  # google_storage_bucket.data-lake-buckets["org-example-111111-prod-us-east1-data-lake"][0m will be created
[0m  [32m+[0m[0m resource "google_storage_bucket" "data-lake-buckets" {
      [32m+[0m[0m force_destroy               = true
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m labels                      = (known after apply)
      [32m+[0m[0m location                    = "US-EAST1"
      [32m+[0m[0m name                        = "org-example-111111-prod-us-east1-data-lake"
      [32m+[0m[0m project                     = (known after apply)
      [32m+[0m[0m public_access_prevention    = "enforced"
      [32m+[0m[0m self_link                   = (known after apply)
      [32m+[0m[0m storage_class               = "STANDARD"
      [32m+[0m[0m uniform_bucket_level_access = true
      [32m+[0m[0m url                         = (known after apply)

      [32m+[0m[0m versioning {
          [32m+[0m[0m enabled = false
        }
    }

[1m  # google_storage_bucket.data-lake-buckets["org-example-111111-prod-us-east1-data-lake-anon"][0m will be created
[0m  [32m+[0m[0m resource "google_storage_bucket" "data-lake-buckets" {
      [32m+[0m[0m force_destroy               = true
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m labels                      = (known after apply)
      [32m+[0m[0m location                    = "US-EAST1"
      [32m+[0m[0m name                        = "org-example-111111-prod-us-east1-data-lake-anon"
      [32m+[0m[0m project                     = (known after apply)
      [32m+[0m[0m public_access_prevention    = "enforced"
      [32m+[0m[0m self_link                   = (known after apply)
      [32m+[0m[0m storage_class               = "STANDARD"
      [32m+[0m[0m uniform_bucket_level_access = true
      [32m+[0m[0m url                         = (known after apply)

      [32m+[0m[0m versioning {
          [32m+[0m[0m enabled = false
        }
    }

[1mPlan:[0m 5 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m ip = (known after apply)
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>